z80/micropython/ports/stm32/boards/F405_OVERRIDE/drivers/nrf24/tests/host_transport_core_test.c
    memset(&config, 0, sizeof(config));
    memset(&radio, 0, sizeof(radio));
    config.node_id = 1;
    config.network_id[0] = 0x01;
    config.network_id[1] = 0xb2;
    config.network_id[2] = 0x37;
    config.network_id[3] = 0xaa;
    config.command_lease_ms = 100;
    config.pipe_lease_ms = 100;
    config.max_rt_window_ms = 100;
    config.max_rt_restarts = 3;
    config.radio.radio = &radio;
    config.radio.ticks_ms = ticks_ms;
    config.radio.irq_is_low = irq_is_low;
    config.radio.io_ok = io_ok;
    transport_core_init(&core, &config);
    assert(transport_core_attach_command_buffer(&core, 0,
        command_buffer_small, sizeof(command_buffer_small)));
    assert(transport_core_attach_command_buffer(&core, 1,
        command_buffer_large, sizeof(command_buffer_large)));
    for (i = 0; i < TRANSPORT_CORE_PIPE_SLOTS; ++i) {
        assert(transport_core_attach_pipe_buffer(&core, i,
            pipe_buffers[i], i == 0 ? 32 : sizeof(pipe_buffers[i])));
    }
    assert(transport_core_attach_control_tx_buffer(&core, control_buffer,
        sizeof(control_buffer)));
    assert(transport_core_start(&core));
    {
        uint16_t max_tx_ms = 0, rx_ms = 0;
        transport_core_get_radio_schedule(&core, &max_tx_ms, &rx_ms);
        assert(max_tx_ms == TRANSPORT_CORE_DEFAULT_MAX_CONTINUOUS_TX_MS);
        assert(rx_ms == TRANSPORT_CORE_DEFAULT_FORCED_RX_MS);
        assert(transport_core_set_radio_schedule(&core, 40, 5));
        transport_core_get_radio_schedule(&core, &max_tx_ms, &rx_ms);
        assert(max_tx_ms == 40 && rx_ms == 5);
        assert(transport_core_set_radio_schedule(&core,
            TRANSPORT_CORE_DEFAULT_MAX_CONTINUOUS_TX_MS,
            TRANSPORT_CORE_DEFAULT_FORCED_RX_MS));
    }

    assert(transport_core_queue_control(&core, TRANSPORT_WIRE_CTS, 9, 3,
        first, sizeof(first)));
    transport_core_service(&core);
    assert(core.tx.active && fake_ce && !fake_rx_mode);
    assert(captured_address[0] == 9);
    assert(memcmp(captured_address + 1, config.network_id, 4) == 0);
    assert(captured_tx[1] == 1 && captured_tx[2] == 9 && captured_tx[3] == 3);
    ack_tx(&core);
    assert(!core.tx.active && fake_rx_mode);

    send_command_to_receiver(&core, config.network_id, 10, first,
        (uint16_t)sizeof(first));
    assert(transport_core_poll_into(&core, event_buffer, sizeof(event_buffer),
        &event_length, &required) == TRANSPORT_POLL_EVENT);
    assert(transport_event_get_type(event_buffer) == TRANSPORT_EVENT_COMMAND_READY);
    assert(transport_event_get_data_length(event_buffer) == sizeof(first));
    assert(memcmp(transport_event_get_data(event_buffer), first, sizeof(first)) == 0);

    /* The first command leaves the ring index at five.  Six bytes therefore
       cross the eight-byte physical end and exercise the two-part ring copy. */
    send_command_to_receiver(&core, config.network_id, 11, wrapped,
        (uint16_t)sizeof(wrapped));
    assert(transport_core_poll_into(&core, event_buffer,
        TRANSPORT_EVENT_HEADER_SIZE + 2, &event_length, &required) ==
            TRANSPORT_POLL_BUFFER_TOO_SMALL);
    assert(required == TRANSPORT_EVENT_HEADER_SIZE + sizeof(wrapped));
    assert(transport_core_poll_into(&core, event_buffer, sizeof(event_buffer),
        &event_length, &required) == TRANSPORT_POLL_EVENT);
    assert(memcmp(transport_event_get_data(event_buffer), wrapped,
        sizeof(wrapped)) == 0);

    make_packet(packet, config.network_id, TRANSPORT_WIRE_STREAM, 7, 1, 20,
        TRANSPORT_WIRE_INTENT | TRANSPORT_WIRE_LAST_PACKET, NULL, 0);
    deliver(&core, packet);
    assert(core.pipes[0].state == TRANSPORT_PIPE_CTS_SENT);
    ack_tx(&core);
    assert(core.pipes[0].state == TRANSPORT_PIPE_OPEN);
    assert(transport_core_poll_into(&core, event_buffer, sizeof(event_buffer),
        &event_length, &required) == TRANSPORT_POLL_EVENT);
    assert(transport_event_get_type(event_buffer) == TRANSPORT_EVENT_PIPE_OPENED);
    make_packet(packet, config.network_id, TRANSPORT_WIRE_STREAM, 7, 1, 20,
        TRANSPORT_WIRE_LAST_PACKET, first, sizeof(first));
    deliver(&core, packet);
    assert((captured_tx[0] & TRANSPORT_WIRE_TYPE_MASK) ==
        TRANSPORT_WIRE_PIPE_CLOSE_ACK);
    ack_tx(&core);
    assert(transport_core_poll_into(&core, event_buffer, sizeof(event_buffer),
        &event_length, &required) == TRANSPORT_POLL_EVENT);
    assert(transport_event_get_type(event_buffer) == TRANSPORT_EVENT_PIPE_RX_DATA);
    assert(memcmp(transport_event_get_data(event_buffer), first, sizeof(first)) == 0);
    assert(transport_core_poll_into(&core, event_buffer, sizeof(event_buffer),
        &event_length, &required) == TRANSPORT_POLL_EVENT);
    assert(transport_event_get_type(event_buffer) == TRANSPORT_EVENT_PIPE_CLOSED);

    intent[0] = 65;
    intent[1] = 0;
    make_packet(packet, config.network_id, TRANSPORT_WIRE_COMMAND, 7, 1, 12,
        TRANSPORT_WIRE_INTENT | TRANSPORT_WIRE_LAST_PACKET,
        intent, sizeof(intent));
    deliver(&core, packet);
    assert(captured_tx[6] == TRANSPORT_CTS_TOO_LARGE);
    ack_tx(&core);

    for (i = 0; i < sizeof(outbound); ++i) outbound[i] = i;
    for (i = 0; i < sizeof(long_stream); ++i) long_stream[i] = i;
    assert(transport_core_send_command(&core, 9, TRANSPORT_WIRE_COMMAND,
        30, outbound, sizeof(outbound)));
    assert(core.tx.kind == TRANSPORT_TX_CONTROL);
    assert((captured_tx[4] & TRANSPORT_WIRE_INTENT) != 0);
    assert(captured_tx[5] == sizeof(outbound) && captured_tx[6] == 0);
    assert(transport_ring_readable(&core.commands[1].buffer) ==
        sizeof(outbound));
    assert(!transport_core_send_command(&core, 8, TRANSPORT_WIRE_COMMAND,
        31, first, sizeof(first)));
    ack_tx(&core);
    assert(core.commands[1].state == TRANSPORT_COMMAND_TX_WAIT_CTS);
    assert(fake_rx_mode);

    make_cts(packet, config.network_id, 9, 1, 99, TRANSPORT_WIRE_COMMAND,
        TRANSPORT_CTS_ACCEPTED, sizeof(outbound));
    deliver(&core, packet);
    assert(core.commands[1].state == TRANSPORT_COMMAND_TX_WAIT_CTS);
    make_cts(packet, config.network_id, 9, 1, 30, TRANSPORT_WIRE_COMMAND,
        TRANSPORT_CTS_ACCEPTED, sizeof(outbound));
    deliver(&core, packet);
    assert(!core.tx.active);
    fake_now += TRANSPORT_CORE_CTS_TURNAROUND_MS;
    transport_core_service(&core);
    assert(core.tx.kind == TRANSPORT_TX_COMMAND);
    assert((captured_tx[4] & TRANSPORT_WIRE_LENGTH_MASK) ==
        TRANSPORT_WIRE_MAX_DATA);
    assert((captured_tx[4] & TRANSPORT_WIRE_LAST_PACKET) == 0);
    assert(memcmp(captured_tx + TRANSPORT_WIRE_HEADER_SIZE, outbound,
        TRANSPORT_WIRE_MAX_DATA) == 0);
    {
        unsigned writes_before_retry = captured_tx_count;
        fake_status |= NRF24_STATUS_MAX_RT;
        transport_core_on_radio_irq(&core);
        assert(core.tx.active);
        assert(core.retry.restarts == 1);
        assert(captured_tx_count == writes_before_retry);
        assert(fake_tx_count == 3);
        assert(core.commands[1].transferred_length == 0);
        assert(transport_ring_readable(&core.commands[1].buffer) == 0);

        /* The first head succeeds and the second reaches MAX_RT before the
           IRQ is serviced.  The second head gets a fresh retry budget. */
        ack_then_max_rt(&core);
        assert(core.tx.active);
        assert(core.retry.restarts == 1);
        assert(captured_tx_count == writes_before_retry);
        assert(fake_tx_count == 2);
        assert(core.commands[1].transferred_length == 0);
    }
    ack_tx(&core);
    assert(transport_ring_readable(&core.commands[1].buffer) == 0);
    assert((captured_tx[4] & TRANSPORT_WIRE_LENGTH_MASK) == 8);
    assert((captured_tx[4] & TRANSPORT_WIRE_LAST_PACKET) != 0);
    ack_tx(&core);
    assert(core.commands[1].state == TRANSPORT_COMMAND_FREE);
    assert(transport_core_poll_into(&core, event_buffer, sizeof(event_buffer),
        &event_length, &required) == TRANSPORT_POLL_EVENT);
    assert(transport_event_get_type(event_buffer) == TRANSPORT_EVENT_COMMAND_SENT);
    assert(transport_event_get_source_id(event_buffer) == 9);
    assert(transport_event_get_transaction_id(event_buffer) == 30);
    assert(transport_event_get_value1(event_buffer) == sizeof(outbound));

    assert(transport_core_send_command(&core, 9, TRANSPORT_WIRE_COMMAND,
        31, NULL, 0));
    ack_tx(&core);
    make_cts(packet, config.network_id, 9, 1, 31, TRANSPORT_WIRE_COMMAND,
        TRANSPORT_CTS_ACCEPTED, 0);
    deliver(&core, packet);
    fake_now += TRANSPORT_CORE_CTS_TURNAROUND_MS;
    transport_core_service(&core);
    assert(core.tx.kind == TRANSPORT_TX_COMMAND);
    assert((captured_tx[4] & TRANSPORT_WIRE_LENGTH_MASK) == 0);
    assert((captured_tx[4] & TRANSPORT_WIRE_LAST_PACKET) != 0);
    ack_tx(&core);
    assert(transport_core_poll_into(&core, event_buffer, sizeof(event_buffer),
        &event_length, &required) == TRANSPORT_POLL_EVENT);
    assert(transport_event_get_type(event_buffer) == TRANSPORT_EVENT_COMMAND_SENT);

    assert(transport_core_send_command(&core, 9, TRANSPORT_WIRE_COMMAND,
        32, first, sizeof(first)));
    ack_tx(&core);
    make_cts(packet, config.network_id, 9, 1, 32, TRANSPORT_WIRE_COMMAND,
        TRANSPORT_CTS_BUSY, 0);
    deliver(&core, packet);
    assert(transport_core_poll_into(&core, event_buffer, sizeof(event_buffer),
        &event_length, &required) == TRANSPORT_POLL_EVENT);
    assert(transport_event_get_type(event_buffer) == TRANSPORT_EVENT_COMMAND_FAILED);
    assert(transport_event_get_value1(event_buffer) ==
        TRANSPORT_COMMAND_FAILURE_CTS_BASE + TRANSPORT_CTS_BUSY);

    assert(transport_core_send_command(&core, 9, TRANSPORT_WIRE_COMMAND,
        33, first, sizeof(first)));
    ack_tx(&core);
    fake_now += config.command_lease_ms;
    transport_core_service(&core);
    assert(transport_core_poll_into(&core, event_buffer, sizeof(event_buffer),
        &event_length, &required) == TRANSPORT_POLL_EVENT);
    assert(transport_event_get_type(event_buffer) == TRANSPORT_EVENT_COMMAND_FAILED);
    assert(transport_event_get_value1(event_buffer) ==
        TRANSPORT_COMMAND_FAILURE_TIMEOUT);

    assert(transport_core_send_command(&core, 9, TRANSPORT_WIRE_COMMAND,
        35, first, sizeof(first)));
    for (i = 0; i < config.max_rt_restarts; ++i) {
        fake_status |= NRF24_STATUS_MAX_RT;
        transport_core_on_radio_irq(&core);
        assert(core.tx.active);
    }
    fake_status |= NRF24_STATUS_MAX_RT;
    transport_core_on_radio_irq(&core);
    assert(transport_core_poll_into(&core, event_buffer, sizeof(event_buffer),
        &event_length, &required) == TRANSPORT_POLL_EVENT);
    assert(transport_event_get_type(event_buffer) == TRANSPORT_EVENT_COMMAND_FAILED);
    assert(transport_event_get_value1(event_buffer) ==
        TRANSPORT_COMMAND_FAILURE_RADIO);
    assert(transport_core_poll_into(&core, event_buffer, sizeof(event_buffer),
        &event_length, &required) == TRANSPORT_POLL_EVENT);
    assert(transport_event_get_type(event_buffer) == TRANSPORT_EVENT_CORE_ERROR);

    assert(transport_core_send_command(&core, 9, TRANSPORT_WIRE_COMMAND,
        34, first, sizeof(first)));
    ack_tx(&core);
    make_cts(packet, config.network_id, 9, 1, 34, TRANSPORT_WIRE_COMMAND,
        TRANSPORT_CTS_ACCEPTED, sizeof(first));
    deliver(&core, packet);
    fake_now += TRANSPORT_CORE_CTS_TURNAROUND_MS;
    transport_core_service(&core);
    for (i = 0; i < config.max_rt_restarts; ++i) {
        fake_status |= NRF24_STATUS_MAX_RT;
        transport_core_on_radio_irq(&core);
        assert(core.tx.active);
    }
    fake_status |= NRF24_STATUS_MAX_RT;
    transport_core_on_radio_irq(&core);
    assert(core.commands[0].state == TRANSPORT_COMMAND_FREE);
    assert(transport_core_poll_into(&core, event_buffer, sizeof(event_buffer),
        &event_length, &required) == TRANSPORT_POLL_EVENT);
    assert(transport_event_get_type(event_buffer) == TRANSPORT_EVENT_COMMAND_FAILED);
    assert(transport_event_get_value1(event_buffer) ==
        TRANSPORT_COMMAND_FAILURE_RADIO);
    assert(transport_core_poll_into(&core, event_buffer, sizeof(event_buffer),
        &event_length, &required) == TRANSPORT_POLL_EVENT);
    assert(transport_event_get_type(event_buffer) == TRANSPORT_EVENT_CORE_ERROR);

