z80/micropython/ports/stm32/boards/F405_OVERRIDE/drivers/nrf24/tests/host_transport_core_test.c
        /* Cumulative byte counters use modular arithmetic.  Repeating credit
           must remain valid when the next grant wraps through zero. */
        pipe->transferred_bytes = UINT32_MAX - 10u;
        pipe->granted_bytes = pipe->transferred_bytes;
        pipe->credit_wait_request = true;
        expected_grant = pipe->transferred_bytes +
            (uint32_t)pipe->buffer.capacity;
        make_packet(packet, config.network_id,
            TRANSPORT_WIRE_PIPE_CREDIT_REQUEST, 9, 1, 61,
            TRANSPORT_WIRE_LAST_PACKET, NULL, 0);
        deliver(&core, packet);
        assert(pipe->granted_bytes == expected_grant);
        assert(core.tx.kind == TRANSPORT_TX_CONTROL);
        assert(captured_tx[TRANSPORT_WIRE_HEADER_SIZE + 2] ==
            (uint8_t)expected_grant);
        assert(captured_tx[TRANSPORT_WIRE_HEADER_SIZE + 3] ==
            (uint8_t)(expected_grant >> 8));
        assert(captured_tx[TRANSPORT_WIRE_HEADER_SIZE + 4] ==
            (uint8_t)(expected_grant >> 16));
        assert(captured_tx[TRANSPORT_WIRE_HEADER_SIZE + 5] ==
            (uint8_t)(expected_grant >> 24));
        ack_tx(&core);

        /* Consume the expected diagnostic from the deliberately failed CTS,
           then release the synthetic receiver slot through its normal
           terminal-event lifecycle. */
        assert(transport_core_poll_into(&core, event_buffer,
            sizeof(event_buffer), &event_length, &required) ==
            TRANSPORT_POLL_EVENT);
        assert(transport_event_get_type(event_buffer) ==
            TRANSPORT_EVENT_CORE_ERROR);
        assert(transport_core_poll_into(&core, event_buffer,
            sizeof(event_buffer), &event_length, &required) ==
            TRANSPORT_POLL_EVENT);
        assert(transport_event_get_type(event_buffer) ==
            TRANSPORT_EVENT_CORE_ERROR);
        pipe->state = TRANSPORT_PIPE_FAILED;
        pipe->close_event_pending = true;
        pipe->terminal_event_reason = TRANSPORT_ERROR_PIPE_TIMEOUT;
        assert(transport_core_poll_into(&core, event_buffer,
            sizeof(event_buffer), &event_length, &required) ==
            TRANSPORT_POLL_EVENT);
        assert(transport_event_get_type(event_buffer) ==
            TRANSPORT_EVENT_PIPE_FAILED);
        assert(pipe->state == TRANSPORT_PIPE_FREE);
        core.config.pipe_lease_ms = saved_lease;
    }

    /* TX_DS for close only starts the protocol-ACK wait.  If that ACK is
       absent, resend close after the peer's hardware retry window. */
    {
        transport_pipe_slot_t *pipe = &core.pipes[1];
        uint16_t saved_lease = core.config.pipe_lease_ms;
        core.config.pipe_lease_ms = 500;
        transport_ring_reset(&pipe->buffer);
        pipe->peer_id = 9;
        pipe->session_id = 48;
        pipe->granted_bytes = 1;
        pipe->transferred_bytes = 0;
        pipe->direction = TRANSPORT_DIRECTION_TX;
        pipe->state = TRANSPORT_PIPE_TX_OPEN;
        pipe->lease_deadline_ms = fake_now + core.config.pipe_lease_ms;

        assert(transport_core_close_pipe(&core, 1));
        assert(core.tx.kind == TRANSPORT_TX_PIPE);
        ack_tx(&core);
        assert(pipe->state == TRANSPORT_PIPE_TX_WAIT_CLOSE_ACK);
        deliver_close_ack(&core, config.network_id, 9, 1, 99);
        assert(pipe->state == TRANSPORT_PIPE_TX_WAIT_CLOSE_ACK);
        {
            uint8_t malformed = 1;
            uint32_t protocol_before = core.stats.protocol_errors;
            make_packet(packet, config.network_id,
                TRANSPORT_WIRE_PIPE_CLOSE_ACK, 9, 1, 48,
                TRANSPORT_WIRE_LAST_PACKET, &malformed, 1);
            deliver(&core, packet);
            assert(pipe->state == TRANSPORT_PIPE_TX_WAIT_CLOSE_ACK);
            assert(core.stats.protocol_errors == protocol_before + 1);
        }
        fake_now += core.config.max_rt_window_ms +
            TRANSPORT_CORE_CTS_TURNAROUND_MS - 1;
        transport_core_service(&core);
        assert(!core.tx.active);
        fake_now++;
        transport_core_service(&core);
        assert(core.tx.kind == TRANSPORT_TX_PIPE);
        assert((captured_tx[4] & TRANSPORT_WIRE_LAST_PACKET) != 0);
        ack_tx(&core);
        deliver_close_ack(&core, config.network_id, 9, 1, 48);
        assert(transport_core_poll_into(&core, event_buffer,
            sizeof(event_buffer), &event_length, &required) ==
            TRANSPORT_POLL_EVENT);
        assert(transport_event_get_type(event_buffer) ==
            TRANSPORT_EVENT_PIPE_CLOSED);
        core.config.pipe_lease_ms = saved_lease;
    }

    /* Exhausting hardware retries for a terminal close is an attempt
       failure, not an immediate pipe failure.  The protocol deadline still
       permits a fresh close attempt. */
    {
        transport_pipe_slot_t *pipe = &core.pipes[1];
        uint16_t saved_lease = core.config.pipe_lease_ms;
        core.config.pipe_lease_ms = 500;
        transport_ring_reset(&pipe->buffer);
        pipe->peer_id = 9;
        pipe->session_id = 49;
        pipe->granted_bytes = 1;
        pipe->transferred_bytes = 0;
        pipe->direction = TRANSPORT_DIRECTION_TX;
        pipe->state = TRANSPORT_PIPE_TX_OPEN;
        pipe->lease_deadline_ms = fake_now + core.config.pipe_lease_ms;

        assert(transport_core_close_pipe(&core, 1));
        fake_status |= NRF24_STATUS_MAX_RT;
        transport_core_on_radio_irq(&core);
        assert(core.tx.active);
        fake_now += core.config.max_rt_window_ms;
        fake_status |= NRF24_STATUS_MAX_RT;
        transport_core_on_radio_irq(&core);
        assert(!core.tx.active);
        assert(pipe->state == TRANSPORT_PIPE_TX_WAIT_CLOSE_ACK);
        fake_now += core.config.max_rt_window_ms +
            TRANSPORT_CORE_CTS_TURNAROUND_MS;
        transport_core_service(&core);
        assert(core.tx.kind == TRANSPORT_TX_PIPE);
        ack_tx(&core);
        deliver_close_ack(&core, config.network_id, 9, 1, 49);
        assert(transport_core_poll_into(&core, event_buffer,
            sizeof(event_buffer), &event_length, &required) ==
            TRANSPORT_POLL_EVENT);
        assert(transport_event_get_type(event_buffer) ==
            TRANSPORT_EVENT_PIPE_CLOSED);
        core.config.pipe_lease_ms = saved_lease;
    }

    /* Waiting for close confirmation remains bounded by the original close
       lease, and timeout releases the outbound slot through a durable event. */
    {
        transport_pipe_slot_t *pipe = &core.pipes[1];
        transport_ring_reset(&pipe->buffer);
        pipe->peer_id = 9;
        pipe->session_id = 51;
        pipe->granted_bytes = 1;
        pipe->transferred_bytes = 0;
        pipe->direction = TRANSPORT_DIRECTION_TX;
        pipe->state = TRANSPORT_PIPE_TX_OPEN;
        pipe->lease_deadline_ms = fake_now + core.config.pipe_lease_ms;

        assert(transport_core_close_pipe(&core, 1));
        ack_tx(&core);
        assert(pipe->state == TRANSPORT_PIPE_TX_WAIT_CLOSE_ACK);
        fake_now += core.config.pipe_lease_ms;
        transport_core_service(&core);
        assert(transport_core_poll_into(&core, event_buffer,
            sizeof(event_buffer), &event_length, &required) ==
            TRANSPORT_POLL_EVENT);
        assert(transport_event_get_type(event_buffer) ==
            TRANSPORT_EVENT_PIPE_FAILED);
        assert(transport_event_get_value0(event_buffer) ==
            TRANSPORT_PIPE_FAILURE_TIMEOUT);
        assert(pipe->state == TRANSPORT_PIPE_FREE);
    }

