z80/micropython/ports/stm32/boards/F405_OVERRIDE/drivers/nrf24/tests/host_transport_core_test.c
    /* A terminal RX event must survive temporary event-queue saturation.
       Once foreground polling frees one descriptor, service retries it. */
    {
        transport_event_fields_t filler;
        uint32_t overflows_before;
        memset(&filler, 0, sizeof(filler));
        filler.type = TRANSPORT_EVENT_CORE_ERROR;
        make_packet(packet, config.network_id, TRANSPORT_WIRE_STREAM, 7, 1,
            46, TRANSPORT_WIRE_INTENT | TRANSPORT_WIRE_LAST_PACKET, NULL, 0);
        deliver(&core, packet);
        ack_tx(&core);
        assert(transport_core_poll_into(&core, event_buffer,
            sizeof(event_buffer), &event_length, &required) ==
            TRANSPORT_POLL_EVENT);
        assert(transport_event_get_type(event_buffer) ==
            TRANSPORT_EVENT_PIPE_OPENED);
        for (i = 0; i < TRANSPORT_CORE_EVENT_QUEUE_SIZE; ++i) {
            assert(transport_core_emit(&core, &filler));
        }
        overflows_before = core.stats.event_queue_overflows;
        make_packet(packet, config.network_id, TRANSPORT_WIRE_STREAM, 7, 1,
            46, TRANSPORT_WIRE_LAST_PACKET, NULL, 0);
        deliver(&core, packet);
        assert((captured_tx[0] & TRANSPORT_WIRE_TYPE_MASK) ==
            TRANSPORT_WIRE_PIPE_CLOSE_ACK);
        ack_tx(&core);
        assert(core.pipes[0].state == TRANSPORT_PIPE_CLOSED);
        assert(core.pipes[0].close_event_pending);
        assert(core.stats.event_queue_overflows > overflows_before);
        assert(transport_core_poll_into(&core, event_buffer,
            sizeof(event_buffer), &event_length, &required) ==
            TRANSPORT_POLL_EVENT);
        assert(transport_event_get_type(event_buffer) ==
            TRANSPORT_EVENT_CORE_ERROR);
        transport_core_service(&core);
        assert(!core.pipes[0].close_event_pending);
        for (i = 1; i < TRANSPORT_CORE_EVENT_QUEUE_SIZE; ++i) {
            assert(transport_core_poll_into(&core, event_buffer,
                sizeof(event_buffer), &event_length, &required) ==
                TRANSPORT_POLL_EVENT);
            assert(transport_event_get_type(event_buffer) ==
                TRANSPORT_EVENT_CORE_ERROR);
        }
        assert(transport_core_poll_into(&core, event_buffer,
            sizeof(event_buffer), &event_length, &required) ==
            TRANSPORT_POLL_EVENT);
        assert(transport_event_get_type(event_buffer) ==
            TRANSPORT_EVENT_PIPE_CLOSED);
        assert(core.pipes[0].state == TRANSPORT_PIPE_FREE);
    }

    {
        int pipe_id = transport_core_open_pipe(&core, 9, 44);
        assert(pipe_id == 0);
        ack_tx(&core);
        fake_now += config.pipe_lease_ms;
        transport_core_service(&core);
        assert(transport_core_poll_into(&core, event_buffer,
            sizeof(event_buffer), &event_length, &required) ==
            TRANSPORT_POLL_EVENT);
        assert(transport_event_get_type(event_buffer) ==
            TRANSPORT_EVENT_PIPE_FAILED);
        assert(transport_event_get_value0(event_buffer) ==
            TRANSPORT_PIPE_FAILURE_TIMEOUT);
    }

    /* An accepted outbound stream must retain an idle lease.  Otherwise a
       vanished application can leave the slot allocated forever.  Its
       failure event must also survive a temporarily full event queue. */
    {
        int pipe_id = transport_core_open_pipe(&core, 9, 45);
        transport_event_fields_t filler;
        assert(pipe_id == 0);
        ack_tx(&core);
        make_cts(packet, config.network_id, 9, 1, 45,
            TRANSPORT_WIRE_STREAM, TRANSPORT_CTS_ACCEPTED, 32);
        deliver(&core, packet);
        assert(transport_core_poll_into(&core, event_buffer,
            sizeof(event_buffer), &event_length, &required) ==
            TRANSPORT_POLL_EVENT);
        assert(transport_event_get_type(event_buffer) ==
            TRANSPORT_EVENT_PIPE_OPENED);
        assert(transport_core_pipe_tx_write(&core, (uint8_t)pipe_id,
            outbound, 10) == 10);
        fake_now += TRANSPORT_CORE_CTS_TURNAROUND_MS;
        transport_core_service(&core);
        ack_tx(&core);
        assert(transport_core_poll_into(&core, event_buffer,
            sizeof(event_buffer), &event_length, &required) ==
            TRANSPORT_POLL_EVENT);
        assert(transport_event_get_type(event_buffer) ==
            TRANSPORT_EVENT_PIPE_TX_SPACE);
        memset(&filler, 0, sizeof(filler));
        filler.type = TRANSPORT_EVENT_CORE_ERROR;
        for (i = 0; i < TRANSPORT_CORE_EVENT_QUEUE_SIZE; ++i) {
            assert(transport_core_emit(&core, &filler));
        }
        fake_now += config.pipe_lease_ms;
        transport_core_service(&core);
        assert(core.pipes[pipe_id].state == TRANSPORT_PIPE_FAILED);
        assert(core.pipes[pipe_id].close_event_pending);
        assert(transport_core_poll_into(&core, event_buffer,
            sizeof(event_buffer), &event_length, &required) ==
            TRANSPORT_POLL_EVENT);
        assert(transport_event_get_type(event_buffer) ==
            TRANSPORT_EVENT_CORE_ERROR);
        transport_core_service(&core);
        assert(!core.pipes[pipe_id].close_event_pending);
        for (i = 1; i < TRANSPORT_CORE_EVENT_QUEUE_SIZE; ++i) {
            assert(transport_core_poll_into(&core, event_buffer,
                sizeof(event_buffer), &event_length, &required) ==
                TRANSPORT_POLL_EVENT);
            assert(transport_event_get_type(event_buffer) ==
                TRANSPORT_EVENT_CORE_ERROR);
        }
        assert(transport_core_poll_into(&core, event_buffer,
            sizeof(event_buffer), &event_length, &required) ==
            TRANSPORT_POLL_EVENT);
        assert(transport_event_get_type(event_buffer) ==
            TRANSPORT_EVENT_PIPE_FAILED);
        assert(transport_event_get_value0(event_buffer) ==
            TRANSPORT_PIPE_FAILURE_TIMEOUT);
        assert(transport_event_get_value1(event_buffer) == 10);
        assert(core.pipes[pipe_id].state == TRANSPORT_PIPE_FREE);
    }

    assert(core.stats.pipes_opened == 5);
    assert(core.stats.pipes_closed == 8);
    assert(core.stats.pipes_failed == 4);

    /* A continuously supplied pipe drains at the fairness deadline, remains
       in RX for the configured dwell, and then resumes the same ring. */
    {
        transport_pipe_slot_t *pipe = &core.pipes[1];
        transport_ring_reset(&pipe->buffer);
        pipe->peer_id = 9;
        pipe->session_id = 45;
        pipe->granted_bytes = sizeof(long_stream);
        pipe->transferred_bytes = 0;
        pipe->direction = TRANSPORT_DIRECTION_TX;
        pipe->state = TRANSPORT_PIPE_TX_OPEN;
        pipe->lease_deadline_ms = fake_now + config.pipe_lease_ms;
        assert(transport_core_pipe_tx_write(&core, 1, long_stream,
            sizeof(long_stream)) == sizeof(long_stream));
        assert(fake_tx_count == 3);

        fake_now += TRANSPORT_CORE_DEFAULT_MAX_CONTINUOUS_TX_MS;
        ack_tx(&core);
        assert(core.radio_phase == TRANSPORT_RADIO_TX_DRAINING);
        assert(transport_ring_readable(&pipe->buffer) ==
            sizeof(long_stream) - 3 * TRANSPORT_WIRE_MAX_DATA);
        ack_tx(&core);
        ack_tx(&core);
        assert(core.radio_phase == TRANSPORT_RADIO_RX_YIELD);
        assert(fake_rx_mode && !core.tx.active);

        fake_now += TRANSPORT_CORE_DEFAULT_FORCED_RX_MS - 1;
        transport_core_service(&core);
        assert(core.radio_phase == TRANSPORT_RADIO_RX_YIELD);
        fake_now++;
        transport_core_service(&core);
        assert(core.tx.kind == TRANSPORT_TX_PIPE);
        assert(fake_tx_count == 2);
        ack_tx(&core);
        ack_tx(&core);
        assert(pipe->transferred_bytes == sizeof(long_stream));
        assert(fake_rx_mode && !core.tx.active);
        assert(transport_core_close_pipe(&core, 1));
        assert(!core.tx.active);
        make_cts(packet, config.network_id, 9, 1, 45,
            TRANSPORT_WIRE_STREAM, TRANSPORT_CTS_ACCEPTED,
            2 * sizeof(long_stream));
        deliver(&core, packet);
        fake_now += TRANSPORT_CORE_CTS_TURNAROUND_MS;
        transport_core_service(&core);
        ack_tx(&core);
        deliver_close_ack(&core, config.network_id, 9, 1, 45);
        while (transport_core_poll_into(&core, event_buffer,
                sizeof(event_buffer), &event_length, &required) ==
                TRANSPORT_POLL_EVENT) {
        }
        assert(core.pipes[1].state == TRANSPORT_PIPE_FREE);
    }

    /* MAX_RT on the initial CTS is ambiguous: the sender may have received
       the grant even though its hardware ACK was lost.  Preserve the RX
       reservation and let the first valid fragment prove that the pipe is
       open.  The open event must be emitted exactly once. */
    {
        transport_pipe_slot_t *pipe = &core.pipes[0];
        unsigned open_events = 0;
        make_packet(packet, config.network_id, TRANSPORT_WIRE_STREAM, 7, 1,
            70, TRANSPORT_WIRE_INTENT | TRANSPORT_WIRE_LAST_PACKET, NULL, 0);
        deliver(&core, packet);
        assert(pipe->state == TRANSPORT_PIPE_CTS_SENT);
        for (i = 0; i < config.max_rt_restarts; ++i) {
            fake_status |= NRF24_STATUS_MAX_RT;
            transport_core_on_radio_irq(&core);
            assert(core.tx.active);
        }
        fake_status |= NRF24_STATUS_MAX_RT;
        transport_core_on_radio_irq(&core);
        assert(!core.tx.active);
        assert(pipe->state == TRANSPORT_PIPE_CTS_SENT);

        make_packet(packet, config.network_id, TRANSPORT_WIRE_STREAM, 7, 1,
            70, 0, first, sizeof(first));
        deliver(&core, packet);
        assert(pipe->state == TRANSPORT_PIPE_OPEN);
        while (transport_core_poll_into(&core, event_buffer,
                sizeof(event_buffer), &event_length, &required) ==
                TRANSPORT_POLL_EVENT) {
            if (transport_event_get_type(event_buffer) ==
                    TRANSPORT_EVENT_PIPE_OPENED) {
                open_events++;
            }
        }
        assert(open_events == 1);

        make_packet(packet, config.network_id, TRANSPORT_WIRE_STREAM, 7, 1,
            70, TRANSPORT_WIRE_LAST_PACKET, NULL, 0);
        deliver(&core, packet);
        assert((captured_tx[0] & TRANSPORT_WIRE_TYPE_MASK) ==
            TRANSPORT_WIRE_PIPE_CLOSE_ACK);
        ack_tx(&core);
        while (transport_core_poll_into(&core, event_buffer,
                sizeof(event_buffer), &event_length, &required) ==
                TRANSPORT_POLL_EVENT) {
            assert(transport_event_get_type(event_buffer) !=
                TRANSPORT_EVENT_PIPE_OPENED);
        }
        assert(pipe->state == TRANSPORT_PIPE_FREE);
    }

