z80/micropython/ports/stm32/boards/F405_OVERRIDE/drivers/nrf24/tests/host_transport_core_test.c
    /* If the initial CTS was genuinely lost, a duplicate stream intent must
       reuse the existing RX reservation and repeat the same cumulative grant.
       Neither the duplicate intent nor a later duplicate may emit a second
       open event. */
    {
        transport_pipe_slot_t *pipe = &core.pipes[0];
        uint32_t initial_grant;
        unsigned open_events = 0;
        make_packet(packet, config.network_id, TRANSPORT_WIRE_STREAM, 7, 1,
            71, TRANSPORT_WIRE_INTENT | TRANSPORT_WIRE_LAST_PACKET, NULL, 0);
        deliver(&core, packet);
        initial_grant = pipe->granted_bytes;
        for (i = 0; i < config.max_rt_restarts; ++i) {
            fake_status |= NRF24_STATUS_MAX_RT;
            transport_core_on_radio_irq(&core);
        }
        fake_status |= NRF24_STATUS_MAX_RT;
        transport_core_on_radio_irq(&core);
        assert(pipe->state == TRANSPORT_PIPE_CTS_SENT);

        make_packet(packet, config.network_id, TRANSPORT_WIRE_STREAM, 7, 1,
            71, TRANSPORT_WIRE_INTENT | TRANSPORT_WIRE_LAST_PACKET, NULL, 0);
        deliver(&core, packet);
        assert(pipe->state == TRANSPORT_PIPE_CTS_SENT);
        assert(core.pipes[1].state == TRANSPORT_PIPE_FREE);
        assert(pipe->granted_bytes == initial_grant);
        assert((captured_tx[0] & TRANSPORT_WIRE_TYPE_MASK) ==
            TRANSPORT_WIRE_CTS);
        assert(captured_tx[TRANSPORT_WIRE_HEADER_SIZE + 2] ==
            (uint8_t)initial_grant);
        ack_tx(&core);
        assert(pipe->state == TRANSPORT_PIPE_OPEN);

        make_packet(packet, config.network_id, TRANSPORT_WIRE_STREAM, 7, 1,
            71, TRANSPORT_WIRE_INTENT | TRANSPORT_WIRE_LAST_PACKET, NULL, 0);
        deliver(&core, packet);
        assert(pipe->state == TRANSPORT_PIPE_OPEN);
        assert((captured_tx[0] & TRANSPORT_WIRE_TYPE_MASK) ==
            TRANSPORT_WIRE_CTS);
        ack_tx(&core);
        while (transport_core_poll_into(&core, event_buffer,
                sizeof(event_buffer), &event_length, &required) ==
                TRANSPORT_POLL_EVENT) {
            if (transport_event_get_type(event_buffer) ==
                    TRANSPORT_EVENT_PIPE_OPENED) {
                open_events++;
            }
        }
        assert(open_events == 1);

        make_packet(packet, config.network_id, TRANSPORT_WIRE_STREAM, 7, 1,
            71, TRANSPORT_WIRE_LAST_PACKET, NULL, 0);
        deliver(&core, packet);
        ack_tx(&core);
        while (transport_core_poll_into(&core, event_buffer,
                sizeof(event_buffer), &event_length, &required) ==
                TRANSPORT_POLL_EVENT) {
        }
        assert(pipe->state == TRANSPORT_PIPE_FREE);
    }

    /* An outbound opening intent is idempotently repeated after terminal
       MAX_RT, but its original pipe lease remains the hard deadline.  Lease
       expiry must release the control TX owner and permit a subsequent open. */
    {
        uint16_t saved_lease = core.config.pipe_lease_ms;
        uint32_t retry_delay = core.config.max_rt_window_ms +
            TRANSPORT_CORE_CTS_TURNAROUND_MS;
        uint32_t original_deadline;
        int pipe_id;
        core.config.pipe_lease_ms = 500;
        pipe_id = transport_core_open_pipe(&core, 9, 72);
        assert(pipe_id == 0);
        original_deadline = core.pipes[pipe_id].lease_deadline_ms;
        assert(original_deadline == fake_now + core.config.pipe_lease_ms);
        for (i = 0; i < config.max_rt_restarts; ++i) {
            fake_status |= NRF24_STATUS_MAX_RT;
            transport_core_on_radio_irq(&core);
        }
        fake_status |= NRF24_STATUS_MAX_RT;
        transport_core_on_radio_irq(&core);
        assert(!core.tx.active);
        assert(core.pipes[pipe_id].state == TRANSPORT_PIPE_TX_WAIT_CTS);
        assert(core.pipes[pipe_id].lease_deadline_ms == original_deadline);

        fake_now += retry_delay;
        transport_core_service(&core);
        assert(core.tx.active && core.tx.kind == TRANSPORT_TX_CONTROL);
        assert((captured_tx[0] & TRANSPORT_WIRE_TYPE_MASK) ==
            TRANSPORT_WIRE_STREAM);
        assert((captured_tx[4] & TRANSPORT_WIRE_INTENT) != 0);
        for (i = 0; i < config.max_rt_restarts; ++i) {
            fake_status |= NRF24_STATUS_MAX_RT;
            transport_core_on_radio_irq(&core);
        }
        fake_status |= NRF24_STATUS_MAX_RT;
        transport_core_on_radio_irq(&core);
        assert(core.pipes[pipe_id].state == TRANSPORT_PIPE_TX_WAIT_CTS);
        assert(core.pipes[pipe_id].lease_deadline_ms == original_deadline);

        fake_now = original_deadline;
        transport_core_service(&core);
        assert(!core.tx.active);
        assert(fake_rx_mode);
        assert(transport_core_poll_into(&core, event_buffer,
            sizeof(event_buffer), &event_length, &required) ==
            TRANSPORT_POLL_EVENT);
        assert(transport_event_get_type(event_buffer) ==
            TRANSPORT_EVENT_PIPE_FAILED);
        assert(transport_event_get_value0(event_buffer) ==
            TRANSPORT_PIPE_FAILURE_TIMEOUT);
        assert(core.pipes[pipe_id].state == TRANSPORT_PIPE_FREE);

        assert(transport_core_open_pipe(&core, 9, 73) == pipe_id);
        ack_tx(&core);
        make_cts(packet, config.network_id, 9, 1, 73,
            TRANSPORT_WIRE_STREAM, TRANSPORT_CTS_BUSY, 0);
        deliver(&core, packet);
        assert(transport_core_poll_into(&core, event_buffer,
            sizeof(event_buffer), &event_length, &required) ==
            TRANSPORT_POLL_EVENT);
        assert(transport_event_get_type(event_buffer) ==
            TRANSPORT_EVENT_PIPE_FAILED);
        assert(core.pipes[pipe_id].state == TRANSPORT_PIPE_FREE);
        core.config.pipe_lease_ms = saved_lease;
    }

    /* Registration datagrams use explicit RF addresses while preserving the
       logical source/destination fields used by Python registration policy. */
    {
        const uint8_t uuid[8] = { 1, 2, 3, 4, 5, 6, 7, 8 };
        uint8_t assignment[9] = { 1, 2, 3, 4, 5, 6, 7, 8, 5 };
        const uint8_t temporary[NRF24_ADDR_LEN] =
            { 0x91, 0x82, 0x73, 0x64, 0x55 };
        uint8_t registration[NRF24_ADDR_LEN];
        uint8_t master_address[NRF24_ADDR_LEN];
        uint32_t protocol_before;

        registration[0] = TRANSPORT_CORE_INVALID_ID;
        master_address[0] = 0;
        memcpy(registration + 1, config.network_id, 4);
        memcpy(master_address + 1, config.network_id, 4);

        transport_core_stop(&core);
        config.node_id = 0;
        config.has_service_address = false;
        transport_core_init(&core, &config);
        assert(transport_core_attach_command_buffer(&core, 0,
            command_buffer_small, sizeof(command_buffer_small)));
        assert(transport_core_attach_command_buffer(&core, 1,
            command_buffer_large, sizeof(command_buffer_large)));
        for (i = 0; i < TRANSPORT_CORE_PIPE_SLOTS; ++i) {
            assert(transport_core_attach_pipe_buffer(&core, i,
                pipe_buffers[i], i == 0 ? 32 : sizeof(pipe_buffers[i])));
        }
        assert(transport_core_attach_control_tx_buffer(&core, control_buffer,
            sizeof(control_buffer)));
        captured_rx_open = 0;
        assert(transport_core_start(&core));
        assert((captured_rx_open & (1u << 1)) != 0);
        assert((captured_rx_open & (1u << 2)) != 0);
        assert(memcmp(captured_rx_address[1], master_address,
            NRF24_ADDR_LEN) == 0);
        assert(memcmp(captured_rx_address[2], registration,
            NRF24_ADDR_LEN) == 0);

        make_packet(packet, config.network_id, TRANSPORT_WIRE_ENUM_HELLO,
            TRANSPORT_CORE_INVALID_ID, 0, 50,
            TRANSPORT_WIRE_LAST_PACKET, uuid, sizeof(uuid));
        deliver(&core, packet);
        assert(transport_core_poll_into(&core, event_buffer,
            sizeof(event_buffer), &event_length, &required) ==
            TRANSPORT_POLL_EVENT);
        assert(transport_event_get_type(event_buffer) ==
            TRANSPORT_EVENT_REGISTRATION_RECEIVED);
        assert(transport_event_get_object_id(event_buffer) ==
            TRANSPORT_WIRE_ENUM_HELLO);
        assert(transport_event_get_source_id(event_buffer) ==
            TRANSPORT_CORE_INVALID_ID);
        assert(transport_event_get_transaction_id(event_buffer) == 50);
        assert(transport_event_get_value0(event_buffer) == 0);
        assert(transport_event_get_data_length(event_buffer) == sizeof(uuid));
        assert(memcmp(transport_event_get_data(event_buffer), uuid,
            sizeof(uuid)) == 0);

        protocol_before = core.stats.protocol_errors;
        make_packet(packet, config.network_id, TRANSPORT_WIRE_ENUM_HELLO,
            TRANSPORT_CORE_INVALID_ID, 0, 51,
            TRANSPORT_WIRE_INTENT | TRANSPORT_WIRE_LAST_PACKET,
            uuid, sizeof(uuid));
        deliver(&core, packet);
        assert(core.stats.protocol_errors == protocol_before + 1);
        assert(transport_core_poll_into(&core, event_buffer,
            sizeof(event_buffer), &event_length, &required) ==
            TRANSPORT_POLL_EMPTY);

        assert(transport_core_send_registration(&core,
            TRANSPORT_WIRE_ENUM_ASSIGN, TRANSPORT_CORE_INVALID_ID, 52,
            temporary, assignment, sizeof(assignment)));
        assert(!transport_core_send_registration(&core,
            TRANSPORT_WIRE_ENUM_ASSIGN, TRANSPORT_CORE_INVALID_ID, 53,
            temporary, assignment, sizeof(assignment)));
        assert(core.tx.kind == TRANSPORT_TX_REGISTRATION);
        assert(memcmp(captured_address, temporary, NRF24_ADDR_LEN) == 0);
        assert((captured_tx[0] & TRANSPORT_WIRE_TYPE_MASK) ==
            TRANSPORT_WIRE_ENUM_ASSIGN);
        assert(captured_tx[1] == 0 &&
            captured_tx[2] == TRANSPORT_CORE_INVALID_ID);
        ack_tx(&core);
        assert(transport_core_poll_into(&core, event_buffer,
            sizeof(event_buffer), &event_length, &required) ==
            TRANSPORT_POLL_EVENT);
        assert(transport_event_get_type(event_buffer) ==
            TRANSPORT_EVENT_REGISTRATION_SENT);
        assert((transport_event_get_flags(event_buffer) &
            TRANSPORT_EVENT_FLAG_TX) != 0);
        assert(transport_event_get_object_id(event_buffer) ==
            TRANSPORT_WIRE_ENUM_ASSIGN);

        make_packet(packet, config.network_id, TRANSPORT_WIRE_ENUM_CONFIRM,
            5, 0, 54, TRANSPORT_WIRE_LAST_PACKET,
            assignment, sizeof(assignment));
        deliver(&core, packet);
        assert(transport_core_poll_into(&core, event_buffer,
            sizeof(event_buffer), &event_length, &required) ==
            TRANSPORT_POLL_EVENT);
        assert(transport_event_get_type(event_buffer) ==
            TRANSPORT_EVENT_REGISTRATION_RECEIVED);
        assert(transport_event_get_object_id(event_buffer) ==
            TRANSPORT_WIRE_ENUM_CONFIRM);

        assert(transport_core_send_registration(&core,
            TRANSPORT_WIRE_ENUM_ASSIGN, TRANSPORT_CORE_INVALID_ID, 55,
            temporary, assignment, sizeof(assignment)));
        for (i = 0; i < config.max_rt_restarts; ++i) {
            fake_status |= NRF24_STATUS_MAX_RT;
            transport_core_on_radio_irq(&core);
            assert(core.registration_tx.pending);
        }
        fake_status |= NRF24_STATUS_MAX_RT;
        transport_core_on_radio_irq(&core);
        assert(!core.registration_tx.pending);
        assert(transport_core_poll_into(&core, event_buffer,
            sizeof(event_buffer), &event_length, &required) ==
            TRANSPORT_POLL_EVENT);
        assert(transport_event_get_type(event_buffer) ==
            TRANSPORT_EVENT_REGISTRATION_FAILED);
        assert(transport_event_get_value1(event_buffer) ==
            TRANSPORT_REGISTRATION_FAILURE_RADIO);
        assert(transport_core_poll_into(&core, event_buffer,
            sizeof(event_buffer), &event_length, &required) ==
            TRANSPORT_POLL_EVENT);
        assert(transport_event_get_type(event_buffer) ==
            TRANSPORT_EVENT_CORE_ERROR);

        transport_core_stop(&core);
        config.node_id = TRANSPORT_CORE_INVALID_ID;
        memcpy(config.service_address, temporary, NRF24_ADDR_LEN);
        config.has_service_address = true;
        transport_core_init(&core, &config);
        assert(transport_core_attach_command_buffer(&core, 0,
            command_buffer_small, sizeof(command_buffer_small)));
        assert(transport_core_attach_command_buffer(&core, 1,
            command_buffer_large, sizeof(command_buffer_large)));
        for (i = 0; i < TRANSPORT_CORE_PIPE_SLOTS; ++i) {
            assert(transport_core_attach_pipe_buffer(&core, i,
                pipe_buffers[i], i == 0 ? 32 : sizeof(pipe_buffers[i])));
        }
        assert(transport_core_attach_control_tx_buffer(&core, control_buffer,
            sizeof(control_buffer)));
        captured_rx_open = 0;
        assert(transport_core_start(&core));
        assert(captured_rx_open == (1u << 1));
        assert(memcmp(captured_rx_address[1], temporary,
            NRF24_ADDR_LEN) == 0);

        make_packet(packet, config.network_id, TRANSPORT_WIRE_ENUM_ASSIGN,
            0, TRANSPORT_CORE_INVALID_ID, 56,
            TRANSPORT_WIRE_LAST_PACKET, assignment, sizeof(assignment));
        deliver(&core, packet);
        assert(transport_core_poll_into(&core, event_buffer,
            sizeof(event_buffer), &event_length, &required) ==
            TRANSPORT_POLL_EVENT);
        assert(transport_event_get_type(event_buffer) ==
            TRANSPORT_EVENT_REGISTRATION_RECEIVED);
        assert(transport_event_get_object_id(event_buffer) ==
            TRANSPORT_WIRE_ENUM_ASSIGN);
        assert(transport_core_set_node_id(&core, 5));
        master_address[0] = 5;
        assert(memcmp(captured_rx_address[1], master_address,
            NRF24_ADDR_LEN) == 0);

        master_address[0] = 0;
        assert(transport_core_send_registration(&core,
            TRANSPORT_WIRE_ENUM_CONFIRM, 0, 57, master_address,
            assignment, sizeof(assignment)));
        assert(!transport_core_set_node_id(&core,
            TRANSPORT_CORE_INVALID_ID));
        ack_tx(&core);
        assert(transport_core_poll_into(&core, event_buffer,
            sizeof(event_buffer), &event_length, &required) ==
            TRANSPORT_POLL_EVENT);
        assert(transport_event_get_type(event_buffer) ==
            TRANSPORT_EVENT_REGISTRATION_SENT);
        assert(transport_core_set_node_id(&core,
            TRANSPORT_CORE_INVALID_ID));
        assert(memcmp(captured_rx_address[1], temporary,
            NRF24_ADDR_LEN) == 0);
        assert(transport_core_send_registration(&core,
            TRANSPORT_WIRE_ENUM_HELLO, 0, 58, registration,
            uuid, sizeof(uuid)));
        assert(memcmp(captured_address, registration, NRF24_ADDR_LEN) == 0);
        assert(captured_tx[1] == TRANSPORT_CORE_INVALID_ID &&
            captured_tx[2] == 0);
        ack_tx(&core);
        assert(transport_core_poll_into(&core, event_buffer,
            sizeof(event_buffer), &event_length, &required) ==
            TRANSPORT_POLL_EVENT);
        assert(transport_event_get_type(event_buffer) ==
            TRANSPORT_EVENT_REGISTRATION_SENT);
    }

    puts("host transport core tests passed");
    return 0;
}
